---
title: StartingViewSettings
classe: Autodesk.Revit.DB.StartingViewSettings
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# StartingViewSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId ViewId { get; set; }` | `startingViewSettings.ViewId` | ElementId |
| `StartingViewSettings GetStartingViewSettings(Document)` | `StartingViewSettings.GetStartingViewSettings(doc)` | StartingViewSettings |
| `Boolean IsAcceptableStartingView(ElementId)` | `startingViewSettings.IsAcceptableStartingView(viewId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```